react_clock_blog/app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    respond_with Post.all